In [1]:
import pandas as pd

In [22]:
people = {
    "first" : ["Gildong", "Chunhyang", "Mongryoung"],
    "last" : ["Hong", "Sung", "Lee"],
    "email" : ["gdhong@gmail.com", "chsung@gmail.com", "mrlee@gmail.com"]
}

In [51]:
df = pd.DataFrame(people)

In [4]:
df

        first  last             email
0     Gildong  Hong  gdhong@gmail.com
1   Chunhyang  Sung  chsung@gmail.com
2  Mongryoung   Lee   mrlee@gmail.com

In [5]:
df['email']

0    gdhong@gmail.com
1    chsung@gmail.com
2     mrlee@gmail.com
Name: email, dtype: object

In [7]:
df[['last', 'email']]

   last             email
0  Hong  gdhong@gmail.com
1  Sung  chsung@gmail.com
2   Lee   mrlee@gmail.com

In [6]:
type(df['email'])

pandas.core.series.Series

In [8]:
type(df[['last', 'email']])

pandas.core.frame.DataFrame

사본에 대해서 upper

In [11]:
df['last'].str.upper()

0    HONG
1    SUNG
2     LEE
Name: last, dtype: object

In [12]:
df

        first  last             email
0     Gildong  Hong  gdhong@gmail.com
1   Chunhyang  Sung  chsung@gmail.com
2  Mongryoung   Lee   mrlee@gmail.com

원본의 'last'칼럼 값들을 모두 대문자로 변경하고자 한다면?

In [27]:
df['last'] = df['last'].str.upper()

In [28]:
df

        first  last             email
0     Gildong  HONG  gdhong@gmail.com
1   Chunhyang  SUNG  chsung@gmail.com
2  Mongryoung   LEE   mrlee@gmail.com

In [30]:
df['last'].str.len()

0    4
1    4
2    3
Name: last, dtype: int64

apply() 함수는 DataFrame 또는 Series의 각 값에 대해서 특정 함수를 정용하고자 할 때 사용될 수 있다.

In [35]:
df['last'].apply(str.upper)

0    HONG
1    SUNG
2     LEE
Name: last, dtype: object

str.upper 에서 upper 만 쓰고싶어서 upper함수를 만든다

파이썬에서 함수는

def 함수이름() :  
&nbsp;&nbsp;&nbsp;&nbsp;함수구현.

In [39]:
def upper(strval) : 
    return strval.upper()
def lower(strval) :
    return strval.lower()

In [37]:
df['last'].apply(upper)

0    HONG
1    SUNG
2     LEE
Name: last, dtype: object

In [45]:
df['last'] = df['last'].apply(lower)
df

        first  last             email
0     Gildong  hong  gdhong@gmail.com
1   Chunhyang  sung  chsung@gmail.com
2  Mongryoung   lee   mrlee@gmail.com

In [62]:
a = df['first']
b = df['last']

a, b = b, a

0       Gildong
1     Chunhyang
2    Mongryoung
Name: first, dtype: object

In [81]:
df['last']

0    Hong
1    Sung
2     Lee
3    None
Name: last, dtype: object

In [67]:
type(a)

pandas.core.series.Series

In [54]:
df

        first  last       email
0     Gildong  Hong     Gildong
1   Chunhyang  Sung   Chunhyang
2  Mongryoung   Lee  Mongryoung

In [68]:
df.apply(len) 
# 데이터 행 갯수

first    3
last     3
email    3
dtype: int64

In [69]:
df.loc[3] = ['chunhyang', None, 'chsung@gmail.com']

In [83]:
df

        first  last             email
0     Gildong  Hong           Gildong
1   Chunhyang  Sung         Chunhyang
2  Mongryoung   Lee        Mongryoung
3   chunhyang  None  chsung@gmail.com

In [84]:
df['first'].count()

4

select count(name) from members  
SQL에서도 name 칼럼 값이 null 이면 카운팅에서 제외된다.  
즉, members 테이블에 5개의 레코드가 있어도, 특정 하나의 레코드의 name 칼럼 값이 null이면  
위 SQL문의 결과는 4가 반환된다.  
이처럼, count() 마찬가지다.  
  
select count( * ) from members;

In [85]:
df.apply(len)

first    4
last     4
email    4
dtype: int64

In [86]:
df.apply(len, axis='columns')

0    3
1    3
2    3
3    3
dtype: int64

In [87]:
df.apply(len, axis='index')

first    4
last     4
email    4
dtype: int64

In [89]:
df.loc[3, 'last'] = 'Sung'

In [90]:
df.apply(min)

first    Chunhyang
last          Hong
email    Chunhyang
dtype: object

In [91]:
df

        first  last             email
0     Gildong  Hong           Gildong
1   Chunhyang  Sung         Chunhyang
2  Mongryoung   Lee        Mongryoung
3   chunhyang  Sung  chsung@gmail.com

In [92]:
df['email'].apply(min)

0    G
1    C
2    M
3    .
Name: email, dtype: object

df.shot_value(by="columns_name")